test/request-response-samples/RetrieveServiceContent__VMware_WS_API_method_should_generate_valid_request/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:interface="urn:vim25" xmlns:vim25="urn:vim25" xmlns:reflect="urn:reflect"><soap:Body><vim25:RetrieveServiceContent xmlns:vim25="urn:vim25" xmlns="urn:vim25"><vim25:_this>ServiceInstance</vim25:_this></vim25:RetrieveServiceContent></soap:Body></soap:Envelope>